# Homework 2: Pandas DataFrames
Dr. Leslie Kerby </br>
Data Science and Applied Machine Learning </br>
Student's name: Dan Hively

In [1]:
import numpy as np
import pandas as pd

## 1. World Population

**Question 1.1**<br/>
Read in the 'world_population.csv' file. Adjust your DataFrame to keep only the 'Year' and 'Population' columns. Show the first 5 elements with the `head` method.

In [2]:
world_pop = pd.read_csv('https://raw.githubusercontent.com/LGKerby/Python/master/world_population.csv',usecols=['Year','Population'])
#print(world_pop)

# Print the head of the world population data
print("--------------")
print("First 5 elements")
print(world_pop.head(5))

--------------
First 5 elements
   Year  Population
0  1950  2557628654
1  1951  2594939877
2  1952  2636772306
3  1953  2682053389
4  1954  2730228104

**Question 1.2**<br/>
How many rows (years) are in the DataFrame? Use python code to give the answer.

In [3]:
print("Number of rows (years) = " + str(len(world_pop.index)))

Number of rows (years) = 66

**Question 1.3**<br/>
What was the population of the world in 1976? Use python code to give the answer.

In [4]:
what_year = 1976

population_for_year = "{:,}".format(world_pop[world_pop['Year'] == what_year]['Population'].values[0])

print("World population for " + str(what_year) + " is = " + str(population_for_year) )

World population for 1976 is = 4,160,185,010

**Question 1.4**<br/>
Use a boolean mask to create a DataFrame called `last_quartile` that contains the world population from years 1975 to 1999. You may do this in two steps (use two boolean masks) or you may do this in one step using the 'and' operator `&`.

*Hint:* For example, to select the years 1960 and 1970 from the DataFrame you would use the 'or' operator `|`:<br/>
`population[ (population['Year'] == 1960) | (population['Year'] == 1970) ]`

In [5]:
year_begin = 1975
year_end   = 1999

last_quartile = world_pop[(world_pop['Year'] >= year_begin) & (world_pop['Year'] <= year_end)]
print(str(last_quartile))
print("-------------------------")

# or using two boolean mask
mask1 = world_pop['Year'] >= year_begin
mask2 = world_pop['Year'] <= year_end
last_quartile = world_pop[mask1 & mask2]
print(str(last_quartile))

    Year  Population
25  1975  4089083233
26  1976  4160185010
27  1977  4232084578
28  1978  4304105753
29  1979  4379013942
30  1980  4451362735
31  1981  4534410125
32  1982  4614566561
33  1983  4695736743
34  1984  4774569391
35  1985  4856462699
36  1986  4940571232
37  1987  5027200492
38  1988  5114557167
39  1989  5201440110
40  1990  5288955934
41  1991  5371585922
42  1992  5456136278
43  1993  5538268316
44  1994  5618682132
45  1995  5699202985
46  1996  5779440593
47  1997  5857972543
48  1998  5935213248
49  1999  6012074922
-------------------------
    Year  Population
25  1975  4089083233
26  1976  4160185010
27  1977  4232084578
28  1978  4304105753
29  1979  4379013942
30  1980  4451362735
31  1981  4534410125
32  1982  4614566561
33  1983  4695736743
34  1984  4774569391
35  1985  4856462699
36  1986  4940571232
37  1987  5027200492
38  1988  5114557167
39  1989  5201440110
40  1990  5288955934
41  1991  5371585922
42  1992  5456136278
43  1993  5538268316
44  1994  5618682132
45  1995  5699202985
46  1996  5779440593
47  1997  5857972543
48  1998  5935213248
49  1999  6012074922

**Question 1.5**<br/>
Now find the average of the world population in `last_quartile`. Use numpy to find the average.

In [6]:
average_population = np.mean(last_quartile['Population'])
print("Average population in last quartile: ", average_population)

Average population in last quartile:  5037315305.76

## 2. Top Movies ##

**Question 2.1**<br/>
Read in 'top_movies.csv' into a DataFrame called `top_movies`. Show the first 5 rows with `head`.

In [7]:
top_movies = pd.read_csv('https://raw.githubusercontent.com/LGKerby/Python/master/top_movies.csv')
top_movies.head()

,Title,Studio,Gross,Gross (Adjusted),Year
0,Star Wars: The Force Awakens,Buena Vista (Disney),906723418,906723400,2015
1,Avatar,Fox,760507625,846120800,2009
2,Titanic,Paramount,658672302,1178627900,1997
3,Jurassic World,Universal,652270625,687728000,2015
4,Marvel's The Avengers,Buena Vista (Disney),623357910,668866600,2012

**Question 2.2**<br/>
What movies were released in 2005? Use python to show just the movies titles (column).

In [8]:
movies = pd.read_csv('https://raw.githubusercontent.com/LGKerby/Python/master/top_movies.csv')
# What is the release year.
released_year = 2005
released_in = movies[movies['Year'] == released_year]

# Display just the movie titles
print(released_in['Title'])

24         Star Wars: Episode III - Revenge of the Sith
60    The Chronicles of Narnia: The Lion, the Witch ...
62                  Harry Potter and the Goblet of Fire
Name: Title, dtype: object

**Question 2.3**<br/>
Use a boolean mask to create a DataFrame called `paramount` that contains only movies produced by 'Paramount'.

In [9]:
# Read the data into the DatFrame
paramount = pd.read_csv('https://raw.githubusercontent.com/LGKerby/Python/master/top_movies.csv')

# Create boolean mask
studio = 'Paramount'
mask = paramount['Studio'] == studio

# Apply mask to DataFrame
what_studio = paramount[mask]
print(studio + " produced " + str(what_studio))
#paramount_count = what_studio.shape[0]
#print(paramount_count)

Paramount produced                                                  Title     Studio      Gross  \
2                                              Titanic  Paramount  658672302
39                                        Forrest Gump  Paramount  330252182
42                                            Iron Man  Paramount  318412101
44   Indiana Jones and the Kingdom of the Crystal S...  Paramount  317101119
46                                          Iron Man 2  Paramount  312433331
77                             Raiders of the Lost Ark  Paramount  248159971
84                                   Beverly Hills Cop  Paramount  234760478
92                                               Ghost  Paramount  217631306
95                              Mission: Impossible II  Paramount  215409889
101                 Indiana Jones and the Last Crusade  Paramount  197171806
103                                             Grease  Paramount  188755690
109                                Mission: Impossible  Paramount  180981856
110               Indiana Jones and the Temple of Doom  Paramount  179870271
111                                            Top Gun  Paramount  179800601
115                                   Crocodile Dundee  Paramount  174803506
124                                           The Firm  Paramount  158348367
125                                   Fatal Attraction  Paramount  156645693
128                               Beverly Hills Cop II  Paramount  153665036
135                                      The Godfather  Paramount  134966411
138                         An Officer and a Gentleman  Paramount  129795554
151                                         Love Story  Paramount  106397186
160                               Saturday Night Fever  Paramount   94213184
174                               The Ten Commandments  Paramount   65500000
188                                        Rear Window  Paramount   36764313
190                         The Greatest Show on Earth  Paramount   36000000

     Gross (Adjusted)  Year
2          1178627900  1997
39          683929300  1994
42          385808100  2008
44          384231200  2008
46          341908200  2010
77          770183000  1981
84          584205200  1984
92          447747400  1990
95          347693200  2000
101         429923500  1989
103         669632000  1978
109         356231300  1996
110         465735500  1984
111         417818200  1986
115         401961400  1986
124         332761100  1993
125         345222500  1987
128         341914500  1987
135         686626300  1972
138         379814600  1982
151         608983900  1970
160         353261200  1977
174        1139700000  1956
188         438086300  1954
190         522000000  1952

**Question 2.4** <br/>
How many movies did Paramount produce? Use python to find the answer.

In [14]:
paramount_produced = what_studio.shape[0]
paramount_produced

25

**Question 2.5**<br/>
In what year was the first movie from Paramount (that appears in this top movies list)? Use python to find the answer.

In [11]:
# Use the what_studio DatFrame

# Sort the what_studio DataFrame by year in ascending order
movies = what_studio.sort_values(by='Year')
print(movies)

# Get the year of the first movie in the DataFrame
first_movie_year = movies.iloc[0]['Year']
print("First movie year = " + str(first_movie_year))

                                                 Title     Studio      Gross  \
190                         The Greatest Show on Earth  Paramount   36000000
188                                        Rear Window  Paramount   36764313
174                               The Ten Commandments  Paramount   65500000
151                                         Love Story  Paramount  106397186
135                                      The Godfather  Paramount  134966411
160                               Saturday Night Fever  Paramount   94213184
103                                             Grease  Paramount  188755690
77                             Raiders of the Lost Ark  Paramount  248159971
138                         An Officer and a Gentleman  Paramount  129795554
110               Indiana Jones and the Temple of Doom  Paramount  179870271
84                                   Beverly Hills Cop  Paramount  234760478
111                                            Top Gun  Paramount  179800601
115                                   Crocodile Dundee  Paramount  174803506
125                                   Fatal Attraction  Paramount  156645693
128                               Beverly Hills Cop II  Paramount  153665036
101                 Indiana Jones and the Last Crusade  Paramount  197171806
92                                               Ghost  Paramount  217631306
124                                           The Firm  Paramount  158348367
39                                        Forrest Gump  Paramount  330252182
109                                Mission: Impossible  Paramount  180981856
2                                              Titanic  Paramount  658672302
95                              Mission: Impossible II  Paramount  215409889
44   Indiana Jones and the Kingdom of the Crystal S...  Paramount  317101119
42                                            Iron Man  Paramount  318412101
46                                          Iron Man 2  Paramount  312433331

     Gross (Adjusted)  Year
190         522000000  1952
188         438086300  1954
174        1139700000  1956
151         608983900  1970
135         686626300  1972
160         353261200  1977
103         669632000  1978
77          770183000  1981
138         379814600  1982
110         465735500  1984
84          584205200  1984
111         417818200  1986
115         401961400  1986
125         345222500  1987
128         341914500  1987
101         429923500  1989
92          447747400  1990
124         332761100  1993
39          683929300  1994
109         356231300  1996
2          1178627900  1997
95          347693200  2000
44          384231200  2008
42          385808100  2008
46          341908200  2010
First movie year = 1952

**Question 2.6**<br/>
What was the name of that movie? Use python to show the answer.

In [12]:
# Get the name of the first movie in the DataFrame
first_movie_name = movies.iloc[0]['Title']
print(first_movie_name)

The Greatest Show on Earth

**Question 2.7.** <br/>
What was the average Adjusted Gross for all the Paramount movies (in this top movies list)? Use numpy.

In [13]:
# Get the Adjusted Gross of all the Paramount movies
adjusted_gross = what_studio['Gross (Adjusted)'].values
print(adjusted_gross)
# Calculate the mean of the Adjusted Gross
mean_adjusted_gross = np.mean(adjusted_gross)
print("Adjusted Gross for all the Paramount movies = " + str(mean_adjusted_gross))

[1178627900  683929300  385808100  384231200  341908200  770183000
  584205200  447747400  347693200  429923500  669632000  356231300
  465735500  417818200  401961400  332761100  345222500  341914500
  686626300  379814600  608983900  353261200 1139700000  438086300
  522000000]
Adjusted Gross for all the Paramount movies = 520560232.0